koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320i.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ID</name>
      <description>ChipID</description>
      <groupName>ID</groupName>
      <baseAddress>0x40002024</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHIPID</name>
          <description>Digital die ID</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000561</resetValue>
          <fields>
            <field>
              <name>PARTID</name>
              <description>Part Identifier</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000FFF</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REV</name>
              <description>Silicon Revision Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWRCTL</name>
      <description>Power management</description>
      <groupName>PWRCTL</groupName>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PWRMOD</name>
          <description>Power modes</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WICENACK</name>
              <description>WIC Acknowledgment for SLEEPDEEP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWRMOD</name>
              <description>Power modes control bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULLACTIVE</name>
                  <description>Active Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORESLEEP</name>
                  <description>CORE_SLEEP Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSSLEEP</name>
                  <description>SYS_SLEEP Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIBERNATE</name>
                  <description>Hibernate Mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRKEY</name>
          <description>Key protection for PWRMOD</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRKEY</name>
              <description>Power control key register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RESET</name>
      <description>Reset</description>
      <groupName>RESET</groupName>
      <baseAddress>0x40002408</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RSTCFG</name>
          <description>Reset configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPIO_PLA_RETAIN</name>
              <description>GPIO/PLA retain their status after WDT and
                software reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>GPIO/PLA don't retain status after
                    watchdog or software reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>GPIO/PLA retain status after watchdog or
                    software reset</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTKEY</name>
          <description>Key protection for RSTCFG</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSTKEY</name>
              <description>Reset configuration key register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTSTA</name>
          <description>Reset status</description>
          <addressOffset>0x00000038</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDRST</name>
              <description>Watchdog timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EXTRST</name>
              <description>External reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POR</name>
              <description>Power-on reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
