koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320i.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UART</name>
      <description>UART</description>
      <groupName>Communications</groupName>
      <baseAddress>0x40005000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UART</name>
        <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>COMTX</name>
          <description>Transmit holding register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000010</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <readAction>modify</readAction>
          <fields>
            <field>
              <name>THR</name>
              <description>Transmit Holding Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x000000FF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>COMRX</name>
          <description>Receive buffer register</description>
          <alternateRegister>COMTX</alternateRegister>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <readAction>modify</readAction>
          <fields>
            <field>
              <name>RBR</name>
              <description>Receive Buffer Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x000000FF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>COMIEN</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EDMAR</name>
              <description>DMA requests in receive mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>DMA requests disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>DMA requests enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDMAT</name>
              <description>DMA requests in transmit mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>DMA requests are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>DMA requests are enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDSSI</name>
              <description>Modem status interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELSI</name>
              <description>Rx status interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETBEI</name>
              <description>Transmit buffer empty interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERBFI</name>
              <description>Receive buffer full interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMIIR</name>
          <description>Interrupt identification register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STA</name>
              <description>Interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODEMSTATUS</name>
                  <description>Modem status interrupt (Read COMMSR to
                    clear)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXBUFEMPTY</name>
                  <description>Transmit buffer empty interrupt (Write to
                    COMTX or read COMIIR to clear)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXBUFFULL</name>
                  <description>Receive buffer full interrupt (Read COMRX
                    to clear)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXLINESTATUS</name>
                  <description>Receive line status interrupt (Read
                    COMLSR to clear)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NIRQ</name>
              <description>Interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Interrupt occurred. Source of interrupt
                    indicated in the STA bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>No interrupt occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMLCR</name>
          <description>Line control register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BRK</name>
              <description>Set Break</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Force TxD to 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Normal TxD operation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP</name>
              <description>Stick Parity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Parity will not be forced based on EPS
                    and PEN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Parity forced based on EPS and PEN</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPS</name>
              <description>Parity Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODD</name>
                  <description>Odd parity will be transmitted and
                    checked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVEN</name>
                  <description>Even parity will be transmitted and
                    checked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEN</name>
              <description>Parity Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Parity will not be transmitted or checked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Parity will be transmitted and checked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Send 1 stop bit regardless of the word
                    length (WLS).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Send a number of stop bits based on the
                    word length. Transmit 1.5 stop bits if the word
                    length is 5 bits (WLS = 00), or 2 stop bits if the
                    word length is 6 (WLS = 01), 7 (WLS = 10), or 8 bits
                    (WLS = 11).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WLS</name>
              <description>Word Length Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIVEBITS</name>
                  <description>5 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXBITS</name>
                  <description>6 bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVENBITS</name>
                  <description>7 bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHTBITS</name>
                  <description>8 bits</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMCR</name>
          <description>Modem control register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOOPBACK</name>
              <description>Loopback mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Normal operation - loopback disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Loopback enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT2</name>
              <description>Output 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Force OUT2 to a logic 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Force OUT2 to a logic 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT1</name>
              <description>Output 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Force OUT1 to a logic 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Force OUT1 to a logic 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTS</name>
              <description>Request to send</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Force RTS to a logic 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Force RTS to a logic 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTR</name>
              <description>Data Terminal Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Force DTR to a logic 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Force DTR to a logic 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
