koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320i.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PLA</name>
      <description>Programmable Logic Array</description>
      <groupName>PLA</groupName>
      <baseAddress>0x40005800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xA8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PLA0</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>PLA1</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>PLA2</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>PLA3</name>
        <value>47</value>
      </interrupt>
      <registers>
        <register>
          <dim>32</dim>
          <dimIncrement>4</dimIncrement>
          <name>PLA_ELEM%s</name>
          <description>ELEMx Configuration Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MUX0</name>
              <description>Even element feedback selection (in
                respective block)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELEM0</name>
                  <description>Feedback from Element 0 (all except
                    Element 0) / Input from other block (Element 0 only)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEM2</name>
                  <description>Feedback from Element 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEM4</name>
                  <description>Feedback from Element 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEM6</name>
                  <description>Feedback from Element 6</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX1</name>
              <description>Odd element feedback selection (in respective
                block)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELEM1</name>
                  <description>Feedback from Element 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEM3</name>
                  <description>Feedback from Element 3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEM5</name>
                  <description>Feedback from Element 5</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEM7</name>
                  <description>Feedback from Element 7</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX2</name>
              <description>Select between correspondng bit from PLA_DINx
                register or even feedback mux</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MMR</name>
                  <description>PLA_DINx input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVEN</name>
                  <description>Even feedback mux</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX3</name>
              <description>Select between GPIO Bus input or odd feedback
                input (for Elements 16-31 odd feedback is always
                selected)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODD</name>
                  <description>odd feedback mux</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBL</name>
              <description>bit 4,3,2,1 configures output for {mux2_out,
                mux3_out} = 11,10,01,00 respectively</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOR</name>
                  <description>NOR.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANDNOTA</name>
                  <description>B and not A.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTA</name>
                  <description>NOT A.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AANDNOTB</name>
                  <description>A and not B.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTB</name>
                  <description>Not B.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXOR</name>
                  <description>EXOR.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NAND</name>
                  <description>NAND.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AND</name>
                  <description>AND.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXNOR</name>
                  <description>EXNOR.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORNOTA</name>
                  <description>B or not A.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>A.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AORNOTB</name>
                  <description>A or not B.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OR</name>
                  <description>OR</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>1.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX4</name>
              <description>Select or bypass flip-flop output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FF</name>
                  <description>output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>Bypass output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLA_CLK</name>
          <description>PLA Clock Select</description>
          <addressOffset>0x00000080</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLOCK3</name>
              <description>Clock select for Block 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P03</name>
                  <description>GPIO clock on P0.3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P11</name>
                  <description>GPIO clock on P1.1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P20</name>
                  <description>GPIO clock on P2.0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>(16 MHz)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0</name>
                  <description>Timer 0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T2</name>
                  <description>Timer 2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KOSC</name>
                  <description>(32 kHz)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLOCK2</name>
              <description>Clock select for Block 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P03</name>
                  <description>GPIO clock on P0.3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P11</name>
                  <description>GPIO clock on P1.1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P20</name>
                  <description>GPIO clock on P2.0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>(16 MHz)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0</name>
                  <description>Timer 0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T2</name>
                  <description>Timer 2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KOSC</name>
                  <description>(32 kHz)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLOCK1</name>
              <description>Clock select for Block 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P03</name>
                  <description>GPIO clock on P0.3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P11</name>
                  <description>GPIO clock on P1.1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P20</name>
                  <description>GPIO clock on P2.0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>(16 MHz)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0</name>
                  <description>Timer 0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T2</name>
                  <description>Timer 2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KOSC</name>
                  <description>(32 kHz)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLOCK0</name>
              <description>Clock select for Block 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P03</name>
                  <description>GPIO clock on P0.3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P11</name>
                  <description>GPIO clock on P1.1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P20</name>
                  <description>GPIO clock on P2.0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>(16 MHz)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0</name>
                  <description>Timer 0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T2</name>
                  <description>Timer 2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KOSC</name>
                  <description>(32 kHz)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLA_IRQ0</name>
          <description>Interrupt Register for Block 0 and 1</description>
          <addressOffset>0x00000084</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>irq1_en</name>
              <description>IRQ1 enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>disable IRQ1 interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>enable IRQ1 interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>irq1_src</name>
              <description>IRQ1 source select (Elements 0-15). 4-bit
                value corresponds to element number (e.g. 1011 selects
                Element 11).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>irq0_en</name>
              <description>IRQ0 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>disable IRQ0 interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>enable IRQ0 interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>irq0_src</name>
              <description>IRQ0 source select (Elements 0-15). 4-bit
                value corresponds to element number (e.g. 1011 selects
                Element 11).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
