koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320i.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IDAC</name>
      <description>IDAC</description>
      <groupName>Analog</groupName>
      <baseAddress>0x40086800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDAC0DAT</name>
          <description>IDAC0 data register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATH</name>
              <description>IDAC0 high data</description>
              <bitOffset>17</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x000007FF</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATL</name>
              <description>IDAC0 low data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000001F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SYNC</name>
              <description>IDAC0 sync bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000003F</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAC0CON</name>
          <description>IDAC0 control register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x00000008</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLRB</name>
              <description>IDAC0 Clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SHT_EN</name>
              <description>IDAC0 shutdown enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BW</name>
              <description>IDAC0 bandwidth</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PUL</name>
              <description>IDAC0 pull down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PD</name>
              <description>IDAC0 power down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Powers IDAC0 up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Powers IDAC0 down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAC1DAT</name>
          <description>IDAC1 data register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATH</name>
              <description>IDAC1 high data</description>
              <bitOffset>17</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x000007FF</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATL</name>
              <description>IDAC1 low data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000001F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SYNC</name>
              <description>IDAC1 sync bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000003F</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAC1CON</name>
          <description>IDAC1 control register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x00000008</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLRB</name>
              <description>IDAC1 Clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SHT_EN</name>
              <description>IDAC1 shutdown enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BW</name>
              <description>IDAC1 bandwidth</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PUL</name>
              <description>IDAC1 pull down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PD</name>
              <description>IDAC1 power down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Powers IDAC1 up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Powers IDAC1 down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAC2DAT</name>
          <description>IDAC2 data register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATH</name>
              <description>IDAC2 high data</description>
              <bitOffset>17</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x000007FF</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATL</name>
              <description>IDAC2 low data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000001F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SYNC</name>
              <description>IDAC2 sync bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000003F</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAC2CON</name>
          <description>IDAC2 control register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x00000008</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLR</name>
              <description>IDAC2 Clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SHT_EN</name>
              <description>IDAC2 shutdown enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BW</name>
              <description>IDAC2 bandwidth</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PUL</name>
              <description>IDAC2 pull down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PD</name>
              <description>IDAC2 power down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Powers IDAC2 up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Powers IDAC2 down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAC3DAT</name>
          <description>IDAC3 data register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATH</name>
              <description>IDAC3 high data</description>
              <bitOffset>17</bitOffset>
              <bitWidth>11</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x000007FF</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATL</name>
              <description>IDAC3 low data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000001F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SYNC</name>
              <description>IDAC3 sync bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000003F</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDAC3CON</name>
          <description>IDAC3 control register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x00000008</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLR</name>
              <description>IDAC3 Clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SHT_EN</name>
              <description>IDAC3 shutdown enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BW</name>
              <description>IDAC3 bandwidth</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PUL</name>
              <description>IDAC3 pull down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PD</name>
              <description>IDAC3 power down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Powers IDAC3 up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Powers IDAC3 down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
