koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320i.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AFE</name>
      <description>Analog</description>
      <groupName>Analog</groupName>
      <baseAddress>0x40087800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x3C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AFETEMPC</name>
          <description>Temp sensor configuration register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>0x00000008</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHOP</name>
              <description>Temperature sensor chopping enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable chopping mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable chopping mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PD</name>
              <description>Temperature sensor power down.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power up temp sensor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power down temp sensor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEREFC</name>
          <description>Reference configuration register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>0x00000008</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B2MA_PDA</name>
              <description>Power down the reference 2mA output driving
                buffer A.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power up 2.5 V reference output driving
                    buffer A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power down 2.5 V reference output driving
                    buffer A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REF</name>
              <description>bypass the internal reference, and select the
                external reference.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Select internal 2.5v reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>Select external 2.5v reference</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2MA_PDB</name>
              <description>Power down the reference 2mA output driving
                buffer B.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power up 2.5 V reference output driving
                    buffer B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power down 2.5 V reference output driving
                    buffer B</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2V5R_PD</name>
              <description>2.5v reference buffer power down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power up 2.5 V reference buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power down 2.5 V reference buffer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BG_PD</name>
              <description>Bandgap power down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power up 1.2 V bandgap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power down 1.2 V bandgap</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AFECOMP</name>
          <description>Analog comparator configuration register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Powers up and enables comparator</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down and disable comparator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up and enable comparator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INNEG</name>
              <description>Selects comparator negative input signal.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVDD2</name>
                  <description>AVDD/2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>AIN5</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC7</name>
                  <description>DAC7</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT</name>
              <description>Connects comparator output to interrupt
                logic.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Do not connect output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Connect output to interrupt logic</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV</name>
              <description>Selects output logic state.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Output will be high if +ve input is above
                    -ve input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Output will be high if +ve input is below
                    -ve input.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPEED</name>
              <description>Selects comparator speed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPEED6</name>
                  <description>6.00us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPEED3</name>
                  <description>3.25us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPEED2</name>
                  <description>1.75us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPEED1</name>
                  <description>1.00us</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYS</name>
              <description>Enables comparator hysteresis</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable hysteresis</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
